Repository: Mario-Bernaldez/AutoKubeDeploy
Catalog: kube-web/locale/*/LC_MESSAGES/django.po
Languages: es

source: Configure Horizontal Pod Autoscaler
es: Configurar Horizontal Pod Autoscaler

source: A Horizontal Pod Autoscaler (HPA) automatically scales the number of pod replicas for a deployment or other scalable resource based on observed CPU utilization or custom metrics. It helps maintain performance and optimize resource usage by adjusting the number of running pods in response to demand.
es: Un Horizontal Pod Autoscaler (HPA) escala automáticamente el número de réplicas de pods para un deployment u otro recurso escalable en función de la utilización de CPU observada o métricas personalizadas. Ayuda a mantener el rendimiento y a optimizar el uso de recursos ajustando el número de pods en ejecución según la demanda.

source: HPA Configuration
es: Configuración de HPA

source: Metrics
es: Métricas

source: Add Metric
es: Agregar métrica

source: Configure Ingress
es: Configurar Ingress

source: An Ingress is a Kubernetes resource that manages external access to services within a cluster, typically HTTP and HTTPS. It provides routing rules to map incoming traffic to internal services based on hostnames or paths. Ingress can also handle TLS termination and virtual host configuration for better traffic control.
es: Un Ingress es un recurso de Kubernetes que gestiona el acceso externo a los servicios dentro de un clúster, normalmente mediante HTTP y HTTPS. Proporciona reglas de enrutamiento para dirigir el tráfico entrante a servicios internos según nombres de host o rutas. También puede encargarse de la terminación TLS y la configuración de hosts virtuales para un mejor control del tráfico.

source: Ingress Configuration
es: Configuración de Ingress

source: Paths
es: Rutas

source: Add Path
es: Agregar ruta

source: Login
es: Iniciar sesión

source: Username
es: Nombre de usuario

source: Password
es: Contraseña

source: Sign in
es: Acceder

source: Only registered users can access the platform.
es: Solo los usuarios registrados pueden acceder a la plataforma.

source: Namespace Configuration
es: Configuración de Namespace

source: Configure Namespace
es: Configurar Namespace

source: A namespace defines a logical grouping of related configuration objects within the system. It helps organize resources under a common context, enabling better isolation, structure, and control. Each namespace typically includes metadata and settings that influence how components interact, and may represent a distinct environment, customer space, or feature domain.
es: Un namespace define una agrupación lógica de objetos de configuración relacionados dentro del sistema. Ayuda a organizar los recursos bajo un contexto común, permitiendo una mejor aislamiento, estructura y control. Cada namespace normalmente incluye metadatos y configuraciones que influyen en cómo interactúan los componentes, y puede representar un entorno distinto, un espacio de cliente o un dominio de funcionalidades.

source: Configure NetworkPolicy
es: Configurar NetworkPolicy

source: A NetworkPolicy is a Kubernetes resource used to control the traffic flow between pods and/or network endpoints. It defines rules for ingress and egress traffic, enabling fine-grained network segmentation within the cluster. Proper configuration of NetworkPolicies enhances the security posture by limiting communication to only what is necessary.
es: Una NetworkPolicy es un recurso de Kubernetes que se utiliza para controlar el flujo de tráfico entre pods y/o puntos finales de red. Define reglas para el tráfico de entrada (ingress) y salida (egress), permitiendo una segmentación de red detallada dentro del clúster. La configuración adecuada de las NetworkPolicies mejora la postura de seguridad al limitar la comunicación únicamente a lo necesario.

source: NetworkPolicy Configuration
es: Configuración de NetworkPolicy

source: Traffic Rules
es: Reglas de tráfico

source: Add Rule
es: Agregar regla

source: Select Object Type
es: Seleccionar tipo de objeto

source: Log out
es: Cerrar sesión

source: Kubernetes Resource Configurator
es: Configurador de Recursos de Kubernetes

source: Configure, monitor and manage your Kubernetes resources easily from a single interface.
es: Configura, supervisa y gestiona tus recursos de Kubernetes fácilmente desde una única interfaz.

source: Which object do you want to configure?
es: ¿Qué objeto deseas configurar?

source: Configuration recommendation
es: Recomendación de configuración

source: You can configure only the objects you need. Some resources may already exist or not be required depending on your cluster's current setup.
es: Puedes configurar solo los objetos que necesitas. Algunos recursos pueden ya existir o no ser necesarios dependiendo de la configuración actual de tu clúster.

source: For a functional and orderly setup, we recommend the following order:
es: Para una configuración funcional y ordenada, recomendamos el siguiente orden:

source: defines a logical environment to group and isolate resources. Useful to separate environments (dev, QA, prod).
es: define un entorno lógico para agrupar y aislar recursos. Útil para separar entornos (dev, QA, prod).

source: sets who can access which resources. It is key for security.
es: define quién puede acceder a qué recursos. Es clave para la seguridad.

source: control pod identity and communications.
es: controla la identidad y las comunicaciones de los pods.

source: store configurations, credentials and persistent data.
es: almacena configuraciones, credenciales y datos persistentes.

source: automatically adjusts replicas based on load.
es: ajusta automáticamente las réplicas según la carga.

source: manages pod lifecycle.
es: gestiona el ciclo de vida de los pods.

source: expose your apps inside or outside the cluster.
es: expone tus aplicaciones dentro o fuera del clúster.

source: Continue
es: Continuar

source: Monitoring
es: Monitorización

source: Access cluster metrics with Grafana.
es: Accede a las métricas del clúster con Grafana.

source: Go to Grafana
es: Ir a Grafana

source: Explore Resources
es: Explorar recursos

source: Browse existing resources in the cluster.
es: Explora los recursos existentes en el clúster.

source: View Resources
es: Ver recursos

source: Review recently deployed YAMLs and re-apply them.
es: Revisa los YAMLs desplegados recientemente y vuelve a aplicarlos.

source: View History
es: Ver historial

source: Language
es: Idioma

source: Select your preferred language.
es: Selecciona tu idioma preferido.

source: Create User
es: Crear Usuario

source: Register a new user with access to the platform.
es: Registrar un nuevo usuario con acceso a la plataforma.

source: Register User
es: Registrar usuario

source: Configure PersistentVolumeClaim
es: Configurar PersistentVolumeClaim

source: A PersistentVolumeClaim (PVC) is a request for storage by a user in Kubernetes. It abstracts the details of how storage is provided, allowing workloads to claim persistent storage resources dynamically. PVCs specify size, access modes, and optionally a storage class to match suitable PersistentVolumes.
es: Un PersistentVolumeClaim (PVC) es una solicitud de almacenamiento por parte de un usuario en Kubernetes. Abstrae los detalles de cómo se proporciona el almacenamiento, permitiendo que las cargas de trabajo reclamen recursos de almacenamiento persistente de forma dinámica. Los PVCs especifican el tamaño, los modos de acceso y, opcionalmente, una clase de almacenamiento para emparejar con los PersistentVolumes adecuados.

source: PVC Configuration
es: Configuración de PVC

source: Configure RBAC
es: Configurar RBAC

source: Configure Role / ClusterRole and Binding
es: Configurar Role / ClusterRole y su Binding

source: RBAC configuration in Kubernetes involves defining Roles or ClusterRoles that specify a set of permissions, and then binding those roles to users, groups, or service accounts using RoleBindings or ClusterRoleBindings. This setup allows for fine-grained access control to cluster resources.
es: La configuración de RBAC en Kubernetes implica definir Roles o ClusterRoles que especifican un conjunto de permisos, y luego vincular esos roles a usuarios, grupos o cuentas de servicio mediante RoleBindings o ClusterRoleBindings. Esta configuración permite un control de acceso detallado a los recursos del clúster.

source: Rules
es: Reglas

source: Add Subject
es: Agregar Subject

source: Create a new user
es: Crear un nuevo usuario

source: Grant staff access
es: Conceder acceso de administrador

source: Configure Secret
es: Configurar Secret

source: A Secret is a Kubernetes object used to store sensitive data such as passwords, tokens, or keys. Unlike ConfigMaps, Secrets are base64-encoded and can be used to securely inject confidential information into containers at runtime. Kubernetes supports various secret types like Opaque, TLS, and Docker config.
es: Un Secret es un objeto de Kubernetes utilizado para almacenar datos sensibles como contraseñas, tokens o claves. A diferencia de los ConfigMaps, los Secrets están codificados en base64 y pueden usarse para inyectar información confidencial de forma segura en los contenedores en tiempo de ejecución. Kubernetes admite varios tipos de secrets como Opaque, TLS y configuración de Docker.

source: Secret Configuration
es: Configuración de Secret

source: Opaque Secret Properties
es: Propiedades del Secret tipo Opaque

source: TLS Secret
es: Secret TLS

source: Docker Config JSON Secret
es: Secret Docker Config JSON

source: Configure ServiceAccount
es: Configurar ServiceAccount

source: A ServiceAccount is an identity used by processes within a pod to interact with the Kubernetes API. It provides scoped permissions through role bindings and is essential for securely managing access to cluster resources. Configuring a ServiceAccount ensures that workloads run with the appropriate access controls.
es: Una ServiceAccount es una identidad utilizada por los procesos dentro de un pod para interactuar con la API de Kubernetes. Proporciona permisos limitados mediante vinculaciones de roles y es esencial para gestionar de forma segura el acceso a los recursos del clúster. Configurar una ServiceAccount garantiza que las cargas de trabajo se ejecuten con los controles de acceso adecuados.

source: ServiceAccount Configuration
es: Configuración de ServiceAccount

source: Add Secret
es: Agregar Secret

source: Configure Service
es: Configurar Service

source: A Service in Kubernetes is an abstraction that defines a logical set of Pods and a policy by which to access them. It enables stable networking and load balancing, allowing other components to reach the backend application regardless of Pod restarts or IP changes. Services can be ClusterIP, NodePort, LoadBalancer, or ExternalName.
es: Un Service en Kubernetes es una abstracción que define un conjunto lógico de Pods y una política para acceder a ellos. Permite una red estable y balanceo de carga, lo que facilita que otros componentes accedan a la aplicación backend independientemente de reinicios de Pods o cambios de IP. Los servicios pueden ser de tipo ClusterIP, NodePort, LoadBalancer o ExternalName.

source: Ports
es: Puertos

source: Add Port
es: Agregar puerto

source: YAML Result
es: Resultado YAML

source: Download YAML
es: Descargar YAML

source: Apply to Kubernetes
es: Aplicar a Kubernetes

source: Select a model:
es: Seleccionar un modelo:

source: Model selection
es: Selección de modelo

source: Get Explanation
es: Obtener explicación

source: Loading explanation...
es: Cargando explicación...

source: Explanation
es: Explicación

source: Spanish
es: Español

source: English
es: Inglés
