Repository: Mario-Bernaldez/AutoKubeDeploy
Catalog: kube-web/locale/*/LC_MESSAGES/django.po
Languages: es

source: Port exposed by the Service (e.g. 80).
es: Puerto expuesto por el Servicio (p. ej., 80).

source: Target Port
es: Puerto de destino

source: Port on the target container (e.g. 8080).
es: Puerto en el contenedor de destino (p. ej., 8080).

source: Protocol
es: Protocolo

source: Network protocol used by this port.
es: Protocolo de red utilizado por este puerto.

source: Node Port
es: Puerto del nodo

source: Optional: External port to expose if Service type is NodePort.
es: Opcional: puerto externo a exponer si el tipo de Servicio es NodePort.

source: Deployment Name
es: Nombre del Deployment

source: Name of the Deployment to be created.
es: Nombre del Deployment que se va a crear.

source: Namespace for the deployment. Defaults to 'default'.
es: Namespace para el deployment. Por defecto: 'default'.

source: Replicas
es: Réplicas

source: Number of pod replicas to maintain.
es: Número de réplicas de pods que se deben mantener.

source: Rolling Update
es: Actualización progresiva

source: Recreate
es: Recrear

source: Deployment Strategy
es: Estrategia de Deployment

source: Choose how updates are rolled out.
es: Elige cómo se aplicarán las actualizaciones.

source: Max Unavailable (RollingUpdate)
es: Máximo no disponible (RollingUpdate)

source: Must be an integer or percentage (e.g. 1 or 25%)
es: Debe ser un número entero o un porcentaje (p. ej., 1 o 25%)

source: Max number of pods that can be unavailable during the update.
es: Número máximo de pods que pueden estar no disponibles durante la actualización.

source: Max Surge (RollingUpdate)
es: Máximo incremento (RollingUpdate)

source: Max number of extra pods to create during the update.
es: Número máximo de pods adicionales que se pueden crear durante la actualización.

source: Pod Name
es: Nombre del Pod

source: Optional name for the pod template.
es: Nombre opcional para la plantilla del pod.

source: Pod Labels (key=value, comma-separated)
es: Etiquetas del Pod (clave=valor, separadas por comas)

source: Must follow the format key=value, comma-separated.
es: Debe seguir el formato clave=valor, separadas por comas.

source: Define labels to assign to the pod. Format: key=value,key2=value2
es: Define etiquetas para asignar al pod. Formato: clave=valor,clave2=valor2

source: Is Init Container?
es: ¿Es un contenedor de inicio?

source: Check this if the container should run before regular containers.
es: Marca esto si el contenedor debe ejecutarse antes que los contenedores normales.

source: Container Name
es: Nombre del contenedor

source: Name of the container.
es: Nombre del contenedor.

source: Container Image
es: Imagen del contenedor

source: Container image name, e.g. nginx:latest.
es: Nombre de la imagen del contenedor, por ejemplo: nginx:latest.

source: Always
es: Siempre

source: If Not Present
es: Si no está presente

source: Never
es: Nunca

source: Image Pull Policy
es: Política de obtención de imagen

source: Specify when to pull the image from the registry.
es: Especifica cuándo obtener la imagen del registro.

source: Command (space-separated)
es: Comando (separado por espacios)

source: Example: /bin/sh -c 'echo hello'
es: Ejemplo: /bin/sh -c 'echo hello'

source: Should be a space-separated list, e.g. /bin/sh -c 'echo hello'
es: Debe ser una lista separada por espacios, por ejemplo: /bin/sh -c 'echo hello'

source: Command to execute in the container. Format: space-separated tokens.
es: Comando a ejecutar en el contenedor. Formato: elementos separados por espacios.

source: Ports (comma-separated numbers)
es: Puertos (números separados por comas)

source: Container ports exposed, e.g. 80,443
es: Puertos expuestos del contenedor, por ejemplo: 80,443

source: Environment Variables (key=value, comma-separated)
es: Variables de entorno (clave=valor, separadas por comas)

source: Define environment variables for the container. Format: key=value,key2=value2
es: Define variables de entorno para el contenedor. Formato: clave=valor,clave2=valor2

source: Volume Name
es: Nombre del volumen

source: Name of the volume to mount.
es: Nombre del volumen que se va a montar.

source: Mount Path
es: Ruta de montaje

source: Filesystem path inside the container where the volume will be mounted.
es: Ruta del sistema de archivos dentro del contenedor donde se montará el volumen.

source: Unique name for the volume within the pod specification.
es: Nombre único del volumen dentro de la especificación del pod.

source: Volume Type
es: Tipo de volumen

source: Secret
es: Secreto

source: Select the type of volume to mount into the pod.
es: Selecciona el tipo de volumen que se montará en el pod.

source: Medium (for emptyDir)
es: Medio (para emptyDir)

source: Leave empty or enter 'Memory' (case-sensitive).
es: Déjalo vacío o introduce 'Memory' (sensible a mayúsculas/minúsculas).

source: Enter 'Memory' to use memory-backed storage or leave blank for disk-backed.
es: Introduce 'Memory' para usar almacenamiento en memoria o déjalo en blanco para usar disco.

source: Size Limit (for emptyDir)
es: Límite de tamaño (para emptyDir)

source: Example: 1Gi, 500Mi, 100Ki, etc.
es: Ejemplo: 1Gi, 500Mi, 100Ki, etc.

source: Optional limit for volume size (e.g., 1Gi, 500Mi).
es: Límite opcional para el tamaño del volumen (p. ej., 1Gi, 500Mi).

source: Path (for hostPath)
es: Ruta (para hostPath)

source: Must be an absolute path, e.g. /data/volume
es: Debe ser una ruta absoluta, p. ej.: /data/volume

source: Absolute path on the host machine to mount inside the container.
es: Ruta absoluta en la máquina host que se montará dentro del contenedor.

source: — (empty) —
es: — (vacío) —

source: Directory
es: Directorio

source: File
es: Archivo

source: HostPath Type (for hostPath)
es: Tipo de HostPath (para hostPath)

source: Specify the type of the host path if required (e.g., File, Directory).
es: Especifica el tipo de ruta del host si es necesario (p. ej., Archivo, Directorio).

source: ConfigMap Name (for configMap)
es: Nombre del ConfigMap (para configMap)

source: Name of the ConfigMap resource to mount as a volume.
es: Nombre del recurso ConfigMap que se montará como volumen.

source: Secret Name (for Secret)
es: Nombre del Secreto (para Secret)

source: Name of the Secret to mount as a volume.
es: Nombre del Secreto que se montará como volumen.

source: PVC Claim Name (for PersistentVolumeClaim)
es: Nombre del reclamo PVC (para PersistentVolumeClaim)

source: Name of the PersistentVolumeClaim to bind to this volume.
es: Nombre del PersistentVolumeClaim que se asociará a este volumen.

source: This field is required for hostPath.
es: Este campo es obligatorio para hostPath.

source: This field is required for configMap.
es: Este campo es obligatorio para configMap.

source: This field is required for Secret.
es: Este campo es obligatorio para Secret.

source: This field is required for PersistentVolumeClaim.
es: Este campo es obligatorio para PersistentVolumeClaim.

source: Namespace Name
es: Nombre del Namespace

source: The name of the namespace. This will be used to logically separate resources in your cluster.
es: El nombre del namespace. Se usará para separar lógicamente los recursos dentro de tu clúster.

source: Namespace Labels
es: Etiquetas del Namespace

source: Optional key=value pairs used to organize and select resources. Default: empty.
es: Pares clave=valor opcionales usados para organizar y seleccionar recursos. Por defecto: vacío.

source: Service Name
es: Nombre del Servicio

source: Name of the Service resource.
es: Nombre del recurso Service.

source: Namespace for the Service. Defaults to 'default'.
es: Namespace para el Service. Por defecto: 'default'.

source: Service Type
es: Tipo de Servicio

source: Select how the Service is exposed: internal, via node ports, or load balancer.
es: Selecciona cómo se expondrá el Servicio: interno, mediante puertos del nodo o con balanceador de carga.

source: Service Selector (key=value, comma-separated)
es: Selector del Servicio (clave=valor, separado por comas)

source: Label selector to match the target pods. Format: app=frontend,role=api
es: Selector de etiquetas para asociar los pods objetivo. Formato: app=frontend,role=api

source: HPA Name
es: Nombre del HPA

source: Name of the HorizontalPodAutoscaler resource.
es: Nombre del recurso HorizontalPodAutoscaler.

source: Namespace where the HPA will be created. Defaults to 'default'.
es: Namespace donde se creará el HPA. Por defecto: 'default'.

source: Target Deployment Name
es: Nombre del Deployment objetivo

source: The name of the Deployment the HPA will scale.
es: Nombre del Deployment que será escalado por el HPA.

source: Minimum Replicas
es: Réplicas mínimas

source: Minimum number of pod replicas allowed.
es: Número mínimo de réplicas de pods permitidas.

source: Maximum Replicas
es: Réplicas máximas

source: Maximum number of pod replicas allowed.
es: Número máximo de réplicas de pods permitidas.

source: Minimum Replicas cannot be greater than Maximum Replicas.
es: Las réplicas mínimas no pueden ser mayores que las réplicas máximas.

source: Resource Name
es: Nombre del Recurso

source: Memory
es: Memoria

source: The resource type to scale by: CPU or Memory.
es: Tipo de recurso por el cual escalar: CPU o Memoria.

source: Target Type
es: Tipo de Objetivo

source: Utilization (%)
es: Utilización (%)

source: Value (absolute)
es: Valor (absoluto)

source: Choose whether to scale based on percentage utilization or an absolute value.
es: Elige si deseas escalar según la utilización porcentual o un valor absoluto.

source: Target Value
es: Valor Objetivo

source: Use a percentage (e.g. 80) for utilization or an absolute unit (e.g. 500Mi) for value.
es: Utiliza un porcentaje (por ejemplo, 80) para la utilización o una unidad absoluta (por ejemplo, 500Mi) para el valor.

source: ConfigMap Name
es: Nombre del ConfigMap

source: The name of the ConfigMap object that will store key-value configuration data.
es: Nombre del objeto ConfigMap que almacenará datos de configuración en formato clave-valor.

source: The namespace where the ConfigMap will be created. Defaults to 'default' if left blank.
es: El namespace donde se creará el ConfigMap. Por defecto será 'default' si se deja vacío.

source: Key
es: Clave

source: The key under which the value will be stored in the ConfigMap. Must be unique within the ConfigMap.
es: Clave bajo la cual se almacenará el valor en el ConfigMap. Debe ser única dentro del ConfigMap.

source: Multiline content (like file data)?
es: ¿Contenido multilínea (como datos de archivo)?

source: Check this box if the value is multiline, such as file content or scripts.
es: Marca esta casilla si el valor es multilínea, como contenido de archivos o scripts.

source: Value
es: Valor

source: The content to store for this key. If multiline, use \n or enable the checkbox above.
es: Contenido que se almacenará para esta clave. Si es multilínea, usa \n o activa la casilla superior.

source: Secret Name
es: Nombre del Secret

source: Name of the Secret resource. Must be unique within the namespace.
es: Nombre del recurso Secret. Debe ser único dentro del namespace.

source: Namespace to store the secret. Defaults to 'default' if left blank.
es: Namespace donde se almacenará el Secret. Por defecto será 'default' si se deja vacío.

source: Secret Type
es: Tipo de Secret

source: Opaque (key-value)
es: Opaco (clave-valor)

source: TLS (Certificate and Private Key)
es: TLS (Certificado y Clave Privada)

source: Docker Config JSON (.dockerconfigjson)
es: Configuración Docker JSON (.dockerconfigjson)

source: Select the type of secret depending on its purpose: generic data, TLS certs, or Docker credentials.
es: Selecciona el tipo de Secret según su propósito: datos genéricos, certificados TLS o credenciales de Docker.

source: The key under which the value will be stored in the secret.
es: La clave bajo la cual se almacenará el valor en el Secret.

source: The value corresponding to the specified key.
es: El valor correspondiente a la clave especificada.

source: TLS Certificate (tls.crt)
es: Certificado TLS (tls.crt)

source: Paste the full TLS certificate content (usually starts with -----BEGIN CERTIFICATE-----).
es: Pega el contenido completo del certificado TLS (normalmente comienza con -----BEGIN CERTIFICATE-----).

source: TLS Private Key (tls.key)
es: Clave Privada TLS (tls.key)

source: Paste the associated private key for the TLS certificate.
es: Pega la clave privada asociada al certificado TLS.

source: Paste the entire content of the Docker config JSON used to authenticate with private registries.
es: Pega el contenido completo del archivo de configuración Docker JSON utilizado para autenticarse en registros privados.

source: PVC Name
es: Nombre del PVC

source: Name of the PersistentVolumeClaim. Must be unique within the namespace.
es: Nombre del PersistentVolumeClaim. Debe ser único dentro del namespace.

source: Namespace where the PVC will be created. Defaults to 'default' if left blank.
es: Namespace donde se creará el PVC. Por defecto será 'default' si se deja vacío.

source: Requested Storage (e.g., 1Gi, 500Mi)
es: Almacenamiento solicitado (por ejemplo: 1Gi, 500Mi)

source: Must be a valid size like 1Gi, 500Mi, 100Ki, etc.
es: Debe ser un tamaño válido como 1Gi, 500Mi, 100Ki, etc.

source: Amount of storage to request. Use units like Mi, Gi, Ti, etc.
es: Cantidad de almacenamiento a solicitar. Usa unidades como Mi, Gi, Ti, etc.

source: Access Modes
es: Modos de acceso

source: Select one or more access modes. 'ReadWriteOnce' is the most common.
es: Selecciona uno o más modos de acceso. 'ReadWriteOnce' es el más común.

source: Storage Class Name (Optional)
es: Nombre de la clase de almacenamiento (opcional)

source: Leave empty for default
es: Déjalo vacío para usar el valor por defecto

source: Name of the storage class to use. Leave empty to use the cluster's default class.
es: Nombre de la clase de almacenamiento a usar. Déjalo vacío para usar la clase por defecto del clúster.

source: Ingress Name
es: Nombre del Ingress

source: Name of the Ingress resource to be created.
es: Nombre del recurso Ingress que se va a crear.

source: Namespace for the Ingress. Defaults to 'default'.
es: Namespace del Ingress. Por defecto será 'default'.

source: Must be a valid domain, e.g., example.com
es: Debe ser un dominio válido, por ejemplo: example.com

source: Fully qualified domain name for routing. Example: app.example.com
es: Nombre de dominio completo para el enrutamiento. Ejemplo: app.example.com

source: Path
es: Ruta

source: URL path to route traffic to the service. Example: / or /api
es: Ruta URL para dirigir el tráfico al servicio. Ejemplo: / o /api

source: The name of the Kubernetes Service to forward traffic to.
es: El nombre del servicio de Kubernetes al cual se redirigirá el tráfico.

source: Service Port
es: Puerto del Servicio

source: Port number on which the target Service is listening.
es: Número de puerto en el que está escuchando el servicio de destino.

source: ServiceAccount Name
es: Nombre del ServiceAccount

source: The name of the ServiceAccount resource to be created or referenced.
es: El nombre del recurso ServiceAccount que se va a crear o referenciar.

source: The namespace where the ServiceAccount resides. If omitted, 'default' will be used.
es: El namespace donde reside el ServiceAccount. Si se omite, se usará 'default'.

source: Image Pull Secret Name
es: Nombre del secreto para la descarga de imágenes

source: The name of the Kubernetes secret used to authenticate when pulling images from a private registry.
es: Nombre del secreto de Kubernetes utilizado para autenticarse al descargar imágenes desde un registro privado.

source: Role Type
es: Tipo de Rol

source: Role (namespaced)
es: Rol (por namespace)

source: ClusterRole (cluster-wide)
es: ClusterRole (a nivel de clúster)

source: Select 'Role' to apply permissions within a namespace or 'ClusterRole' for cluster-wide access.
es: Selecciona 'Role' para aplicar permisos dentro de un namespace o 'ClusterRole' para acceso a nivel de clúster.

source: Role/ClusterRole Name
es: Nombre del Role/ClusterRole

source: The name of the Role or ClusterRole to create or bind to.
es: Nombre del Role o ClusterRole que se va a crear o vincular.

source: Namespace (only for Role)
es: Namespace (solo para Role)

source: Leave empty for ClusterRole
es: Déjalo vacío para ClusterRole

source: Required only when creating a Role. Leave empty for ClusterRoles.
es: Requerido solo al crear un Role. Déjalo vacío para ClusterRoles.

source: API Groups (comma-separated, empty for core)
es: Grupos de API (separados por comas, vacío para core)

source: Comma-separated list of API groups this rule applies to. Leave empty for the core API group.
es: Lista de grupos de API separados por comas a los que se aplica esta regla. Déjalo vacío para el grupo de API principal.

source: Resources (comma-separated)
es: Recursos (separados por comas)

source: List of resource types (e.g., pods, services) this rule applies to.
es: Lista de tipos de recursos (por ejemplo, pods, services) a los que se aplica esta regla.

source: Verbs (comma-separated)
es: Verbos (separados por comas)

source: Actions allowed: e.g., get, list, watch, create, delete, update.
es: Acciones permitidas: por ejemplo, get, list, watch, create, delete, update.

source: Binding Name
es: Nombre de la vinculación

source: The name of the RoleBinding or ClusterRoleBinding.
es: El nombre del RoleBinding o ClusterRoleBinding.

source: Namespace (only for RoleBinding)
es: Namespace (solo para RoleBinding)

source: Leave empty for ClusterRoleBinding
es: Déjalo vacío para ClusterRoleBinding

source: Specify the namespace only if creating a RoleBinding.
es: Especifica el namespace solo si estás creando un RoleBinding.

source: Subject Kind
es: Tipo de sujeto

source: User
es: Usuario

source: Group
es: Grupo

source: Select the type of subject to bind: a User, a Group, or a ServiceAccount.
es: Selecciona el tipo de sujeto a vincular: un Usuario, un Grupo o un ServiceAccount.

source: Subject Name
es: Nombre del sujeto

source: The name of the user, group, or service account to grant access to.
es: El nombre del usuario, grupo o cuenta de servicio al que se otorgará acceso.

source: Subject Namespace (only for ServiceAccount)
es: Namespace del sujeto (solo para ServiceAccount)

source: Only required for ServiceAccount
es: Solo requerido para ServiceAccount

source: Required only if the subject is a ServiceAccount. Leave empty otherwise.
es: Requerido solo si el sujeto es un ServiceAccount. Déjalo vacío en caso contrario.

source: NetworkPolicy Name
es: Nombre del NetworkPolicy

source: The name of the NetworkPolicy resource. It must be unique within the namespace.
es: El nombre del recurso NetworkPolicy. Debe ser único dentro del namespace.

source: The namespace to which this NetworkPolicy will apply. Defaults to 'default' if left blank.
es: El namespace al que se aplicará esta NetworkPolicy. Por defecto será 'default' si se deja en blanco.

source: Pod Selector (key=value, comma-separated)
es: Selector de Pods (clave=valor, separados por comas)

source: Format: key=value, separated by commas
es: Formato: clave=valor, separados por comas

source: Selects the pods to which this policy applies. Format: key=value pairs separated by commas.
es: Selecciona los pods a los que se aplica esta política. Formato: pares clave=valor separados por comas.

source: Policy Types
es: Tipos de política

source: Choose one or both to specify the traffic direction: 'Ingress' for incoming or 'Egress' for outgoing.
es: Elige uno o ambos para especificar la dirección del tráfico: 'Ingress' para entrante o 'Egress' para saliente.

source: Direction
es: Dirección

source: Defines the direction of traffic this rule applies to: Ingress (incoming) or Egress (outgoing).
es: Define la dirección del tráfico a la que se aplica esta regla: Ingress (entrante) o Egress (saliente).

source: Ports (comma-separated)
es: Puertos (separados por comas)

source: List of ports to allow or restrict, separated by commas. Example: 80,443,8080
es: Lista de puertos a permitir o restringir, separados por comas. Ejemplo: 80,443,8080

source: Applies the rule to traffic from/to pods matching these labels. Format: key=value
es: Aplica la regla al tráfico de/para pods que coincidan con estas etiquetas. Formato: clave=valor

source: Namespace Selector (key=value, comma-separated)
es: Selector de Namespace (clave=valor, separados por comas)

source: Restrict the rule to namespaces matching these labels. Format: key=value
es: Restringe la regla a los namespaces que coincidan con estas etiquetas. Formato: clave=valor

source: IP Block (CIDR)
es: Bloque IP (CIDR)

source: Specify a CIDR range to apply the rule to a set of IPs.
es: Especifica un rango CIDR para aplicar la regla a un conjunto de IPs.

source: IP Exceptions (comma-separated CIDRs)
es: Excepciones de IP (CIDRs separados por comas)

source: List of CIDR IPs to exclude from the IP block. Separate multiple entries with commas.
es: Lista de IPs en formato CIDR a excluir del bloque IP. Separa múltiples entradas con comas.

source: You must add at least one container.
es: Debes añadir al menos un contenedor.

source: Configure ConfigMap
es: Configurar ConfigMap

source: Back
es: Volver

source: A ConfigMap is a Kubernetes resource used to store non-confidential configuration data in key-value pairs. It allows you to decouple configuration artifacts from container images, enabling easier updates and management of application settings across environments.
es: Un ConfigMap es un recurso de Kubernetes utilizado para almacenar datos de configuración no confidenciales en pares clave-valor. Permite desacoplar los artefactos de configuración de las imágenes de contenedor, lo que facilita las actualizaciones y la gestión de la configuración de la aplicación a lo largo de diferentes entornos.

source: ConfigMap Configuration
es: Configuración de ConfigMap

source: Properties
es: Propiedades

source: Remove
es: Eliminar

source: Add Property
es: Agregar propiedad

source: Generate YAML
es: Generar YAML

source: Configure Deployment
es: Configurar Deployment

source: A Deployment is a Kubernetes resource used to manage and update a set of replicated Pods. It provides declarative updates, rollback functionality, and ensures the desired number of replicas are running and available. Deployments simplify the management of stateless applications and support rolling updates with minimal downtime.
es: Un Deployment es un recurso de Kubernetes utilizado para gestionar y actualizar un conjunto de Pods replicados. Proporciona actualizaciones declarativas, funcionalidad de reversión y garantiza que el número deseado de réplicas esté en ejecución y disponible. Los Deployments simplifican la gestión de aplicaciones sin estado y permiten actualizaciones continuas con un tiempo de inactividad mínimo.

source: Pod Template
es: Plantilla de Pod

source: Containers
es: Contenedores

source: Add Volume Mount
es: Agregar Volume Mount

source: Add Container
es: Agregar contenedor

source: Add Volume
es: Agregar volumen

source: Resources
es: Recursos

source: Delete
es: Eliminar

source: No resources found.
es: No se encontraron recursos.

source: Are you sure you want to delete
es: ¿Estás seguro de que deseas eliminar

source: Cancel
es: Cancelar

source: Deployment History
es: Historial de Deployments

source: Date
es: Fecha

source: Type
es: Tipo

source: Name
es: Nombre

source: Unknown
es: Desconocido

source: View
es: Ver

source: No deployments have been recorded yet.
es: Aún no se ha registrado ningún Deployment.

source: ⬅ Back to Home
es: ⬅ Volver al inicio

source: Configure HPA
es: Configurar HPA
